# AreaSchemeId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AreaSchemeId Property
ParameterTypeId Class See Also
---
"Area Scheme Id"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AreaSchemeId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AreaSchemeId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AreaSchemeId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace